DataProcessors/OPERACODE_ЗагрузкаРаботИзЦентраль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>OPERACODE_ЗагрузкаРаботИзЦентраль</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеПроверятьСуществующиеРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидНормировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_СложностьРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_СложностьРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДанныеВЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетДляКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРасходаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/OPERACODE_ЗагрузкаРаботИзЦентраль/Ext/ObjectModule.bsl
Процедура ОбработкаНаСервере(МенятьНаименования = Ложь, ТолькоВПапку = Неопределено) Экспорт
	
	АдресWS = Константы.Renault_АдресWebСервисов.Получить();
	ЛогинWS = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	BIR = Константы.Renault_BIR_db.Получить();
	
	Адрес = АдресWS + "ws/auto_service.ws";
	Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	WSОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
	СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(WSОпределение, "http://renault-nissan.com/schema/service", 
	"ОбменАвтосервис", "ОбменАвтосервисSoap12", 3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	
	Сообщение = "Получаем автоработы из базы Renault.";
	
	#Если Клиент Тогда
		Оповестить("ЗагрузкаАвторабот", Сообщение);
	#Иначе
		Сообщить(Сообщение);		
	#КонецЕсли
	
	Ответ = ВебСервис.GetAutoworks();
	
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	ТЗРезультат = Сериализатор.ПрочитатьXDTO(Ответ);
	
	Всего = ТЗРезультат.Количество();
	Загружено = 0;
	
	Сообщение = "Всего авторабот в базе Renault: " + Строка(Всего);
	
	#Если Клиент Тогда
		Оповестить("ЗагрузкаАвторабот", Сообщение);
	#Иначе
		Сообщить(Сообщение);		
	#КонецЕсли


	
	ПапкаАвторабот = Справочники.Автоработы.НайтиПоНаименованию("DMS Renault", Истина);
	Если ПапкаАвторабот <> Неопределено И ПапкаАвторабот.ЭтоГруппа Тогда
		//ОК
	Иначе
		ПапкаАвтоработОбъект = Справочники.Автоработы.СоздатьГруппу();
		ПапкаАвтоработОбъект.Наименование = "DMS Renault";
		ПапкаАвтоработОбъект.НаименованиеПолное = "DMS Renault";
		ПапкаАвтоработОбъект.Записать();
		ПапкаАвторабот = ПапкаАвтоработОбъект.Ссылка;
	КонецЕсли;
	
	
	ДеревоРабот = ТаблицаЗначенийВДеревоЗначений(ТЗРезультат, "Родитель");
	
	Если ЗначениеЗаполнено(ТолькоВПапку) Тогда
	
		ДеревоРабот = ДеревоРабот.Строки.Найти(ТолькоВПапку.Наименование);
		
		СоздатьРаботыПоГруппе(ДеревоРабот, Загружено, МенятьНаименования, ТолькоВПапку);
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого Группа из ДеревоРабот.Строки Цикл
		
		//Если НЕ Группа.ЭтоГруппа Тогда
		//	
		//	Продолжить;
		//	
		//КонецЕсли;
		
		ИмяГруппы = Группа[0];
		
		Если НЕ ЗначениеЗаполнено(ИмяГруппы) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Сообщение = "Загружаем автоработы для: " + Строка(ИмяГруппы) 
			+ Символы.ПС + "Всего уже загружено: " + Строка(Загружено) + " из: " + Строка(Всего);
			
		#Если Клиент Тогда
			Оповестить("ЗагрузкаАвторабот", Сообщение);
		#Иначе
			Сообщить(Сообщение);		
		#КонецЕсли

			
		НовыйЭлементСсылка = Справочники.Автоработы.НайтиПоНаименованию(ИмяГруппы, Истина, ПапкаАвторабот);
		Если НовыйЭлементСсылка <> Неопределено И НовыйЭлементСсылка.ЭтоГруппа Тогда
			
			Родитель = НовыйЭлементСсылка.Ссылка;
			
		Иначе
			НовыйЭлемент = Справочники.Автоработы.СоздатьГруппу();
			НовыйЭлемент.Наименование = ИмяГруппы;
			НовыйЭлемент.НаименованиеПолное = ИмяГруппы;
			НовыйЭлемент.Родитель = ПапкаАвторабот;
			НовыйЭлемент.УстановитьНовыйКод();
			
			Попытка
			
				НовыйЭлемент.Записать();
				
				Родитель = НовыйЭлемент.Ссылка;
				
			Исключение
				
				
				Сообщить(ОписаниеОшибки());
				Продолжить;
				
			КонецПопытки;
				
		КонецЕсли;
		
		СоздатьРаботыПоГруппе(Группа, Загружено, МенятьНаименования, Родитель);

		
	КонецЦикла;
	
	Сообщение = "Загрузка завершена.";
			
	#Если Клиент Тогда
		Оповестить("ЗагрузкаАвторабот", Сообщение);
	#Иначе
		Сообщить(Сообщение);		
	#КонецЕсли

	
КонецПроцедуры

Процедура СоздатьРаботыПоГруппе(Знач Группа, Загружено, Знач МенятьНаименования, Знач Родитель)
	
	Перем НовыйЭлемент, НовыйЭлементСсылка, Работа, СтрокаДлительности;
	
	Для Каждого Работа ИЗ Группа.Строки Цикл
		
		Если НеПроверятьСуществующиеРаботы = Истина Тогда
			
			НовыйЭлементСсылка = Справочники.Автоработы.ПустаяСсылка();
			
		Иначе
			
			НовыйЭлементСсылка = Справочники.Автоработы.НайтиПоРеквизиту("Артикул", Работа.Артикул, Родитель);
			
		КонецЕсли;
		
		Если НовыйЭлементСсылка <> Справочники.Автоработы.ПустаяСсылка() Тогда
			НовыйЭлемент = НовыйЭлементСсылка.ПолучитьОбъект();
		Иначе
			НовыйЭлемент = Справочники.Автоработы.СоздатьЭлемент();
			НовыйЭлемент.УстановитьНовыйКод();
		КонецЕсли;
		
		НовыйЭлемент.Артикул = Работа.Артикул;
		НовыйЭлемент.Родитель = Родитель;
		//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
			НовыйЭлемент.ВремяВыполнения = Работа.ВремяВыполнения;
		//ИначеЕсли ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
		//	СтрокаДлительности = НовыйЭлемент.НормыВремени.Добавить();
		//	СтрокаДлительности.ВремяВыполнения = Работа.ВремяВыполнения;
		//	СтрокаДлительности.КлассАвтомобиля = Справочники.Renault_КлассыАвтомобилей.ОбщиеРаботы;
		//КонецЕсли;
		
		Попытка
			
			НовыйЭлемент.Renault_OPERACODV2_ВидНормировки = Работа.ВидНормировки;
			Если ЗначениеЗаполнено(Работа.ВидРабот) Тогда
				НовыйЭлемент.Renault_OPERACODV2_ВидРабот = Перечисления.OPERACODE_ВидыРабот.Получить(Работа.ВидРабот);
			КонецЕсли;
			Если ЗначениеЗаполнено(Работа.СложностьРабот) Тогда
				НовыйЭлемент.Renault_OPERACODV2_СложностьРабот = Перечисления.OPERACODE_СложностьРабот.Получить(Работа.СложностьРабот);
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
		//Сообщить("Загружаем автоработы для: " + Строка(СтрокаОтвета.Наименование) 
		//+ Символы.ПС + "Ввсего уже загружено: " + Строка(Загружено) + " из: " + Строка(Всего));
		
		
		НовыйЭлемент.Номенклатура = Справочники.Номенклатура.Авторабота;
		
		Если МенятьНаименования = Истина Тогда
			
			НовыйЭлемент.НаименованиеПолное = Работа.Наименование;
			
			Если ЗначениеЗаполнено(Работа.НаименованиеПолное) Тогда 
				
				НовыйЭлемент.Наименование = Работа.НаименованиеПолное;
				
			Иначе
				
				НовыйЭлемент.Наименование = Работа.Наименование
				
			КонецЕсли;
			
		Иначе
			
			НовыйЭлемент.Наименование = Работа.Наименование;
			НовыйЭлемент.НаименованиеПолное = Работа.НаименованиеПолное;
			
		КонецЕсли;
		
		
		Попытка
			
			НовыйЭлемент.Записать();
			
			Загружено = Загружено + 1;
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			Продолжить;
			
		КонецПопытки;
		
		
	КонецЦикла;

КонецПроцедуры

Функция ТаблицаЗначенийВДеревоЗначений(ТЗ, ГруппировкаКолонка) Экспорт 
   ПЗ             = Новый ПостроительЗапроса;
   ПЗ.ИсточникДанных          = Новый ОписаниеИсточникаДанных(ТЗ);//передаем ТЗ
   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
   ПЗ.ИсточникДанных.Колонки[ГруппировкаКолонка].Измерение = Истина;//по этой колонке идет группировка
   ПЗ.ЗаполнитьНастройки();
   ПЗ.Выполнить();
   Дерево = ПЗ.Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);  
   Возврат Дерево;  
КонецФункции
